# Stepik_course_c++
https://stepik.org/course/7/syllabus


Напишите функцию power, реализующую возведение целого числа в неотрицательную целую степень. Функция power должна принимать на вход два целых числа и возвращать целое число (смотрите шаблон кода). При выполнении задания учтите, что функция обязательно должна называться power, функция ничего не должна читать со входа или выводить.
Требования к реализации: в этом задании вам нужно реализовать только функцию power. Вы можете определять вспомогательные функции, если они вам нужны. Реализовывать функции main не нужно. 
Ограничения: библиотеку cmath (и math.h) использовать запрещено.
```c++
int power(int x, unsigned p) {
  int answer = 1;
  for (int i = 0; i < p; ++i) {
    answer *= x;
  }
  return answer;
}
```

---

Из лекции вы узнали, что использование макросов вместо функций — это зло. Для того, чтобы лучше разобраться, почему так непросто написать хороший макрос, и почему макросы лучше не использовать, мы предлагаем вам самостоятельно реализовать такую функцию-макрос.
Реализуйте макрос MAX от трёх параметров, который присваивает целочисленной (int) переменной, переданной в качестве третьего аргумента, наибольшее из значений, переданных в первых двух аргументах. Пример вызова макроса:
```c++
int a = 10;
int b = 20;
int c = 0;
MAX(a, b, c); // теперь c равно 20
MAX(a += b, b, c); // теперь a = с = 30
```
При написании макроса постарайтесь учесть как можно больше вариантов его использования. 

Требования к реализации: вам нужно реализовать только макрос MAX. Функцию main и какие-либо другие функции реализовывать не нужно. Попробуйте решить эту задачу исключительно средствами макросов.

Подсказка: возможно вам потребуется какая-нибудь синтаксическая конструкция для объединения нескольких инструкций.  Помните, что макросы просто подставляют текст в место вызова, препроцессор ничего не знает про синтаксис C++. Напишите макрос так, чтобы при его подстановке в месте вызова получился корректный код. Проверьте, что Ваш код можно применить несколько раз в одной функции и это не вызовет ошибку. Если будете определять какие-нибудь переменные, то постарайтесь сделать так, чтобы они не влияли на внешний код.

```c++
#define MAX(x, y, r) \
do { int aa = ( x ); int bb = ( y ); ( r ) = bb < aa ? aa : bb; } while ( false )
```

---

Простая задача на закрепления материала по работе с  вводом/выводом. Напишите программу, которая суммирует целые числа. На вход программе подаются целые числа в следующем формате: на первой строке идет целое число T — количество тестов, далее следует T строк, в каждой из которых через пробел идут два целых числа ai и bi. На выводе для каждой из T строк нужно вывести сумму ai+bi  в том порядке, в котором пары поступают на вход. Ничего, кроме этого, выводить не нужно.
```c++
#include <iostream>
using namespace std;

int main()
{
  int T;
  cin >> T;
  int a, b;
  for (int i = 0; i < T; ++i)
  {
    cin >> a;
    cin >> b;
    cout << a + b << '\n';
  }
  return 0;
}
```
